tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "railwaycat/emacsmacport"
tap "willdoescode/natls"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Spell checker with better logic than ispell
brew "aspell"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Defines a standard way of committing rules and communicating it
brew "commitizen"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image processing and image analysis library
brew "leptonica"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc", link: false
# Geometry Engine
brew "geos"
# Framework for scientific data networking
brew "libdap"
# Cartographic Projections Library
brew "proj"
# Library and tools for dealing with GeoTIFF
brew "libgeotiff"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Adds spatial SQL capabilities to SQLite
brew "libspatialite"
# Package for scientific computing with Python
brew "numpy"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Geospatial Data Abstraction Library
brew "gdal"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Alternative to top/htop
brew "glances"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Spell checker and morphological analyzer
brew "hunspell"
# Command-line benchmarking tool
brew "hyperfine"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# LastPass command-line interface tool
brew "lastpass-cli"
# Simple terminal UI for git commands
brew "lazygit"
# MNG/JNG reference library
brew "libmng"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pandoc filter for numbering and cross-referencing
brew "pandoc-crossref"
# Highly capable, feature-rich programming language
brew "perl"
# General-purpose scripting language
brew "php"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Cross-platform application and UI framework
brew "qt@5"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler-qt5"
# Object-relational database system
brew "postgresql@14"
# Cross-platform application and UI framework
brew "qt"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Version control system designed to be a better CVS
brew "subversion"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Unidata unit conversion library
brew "udunits"
# Ncurses-based file manager with vi-like keybindings
brew "vifm"
# Internet file retriever
brew "wget"
# Check your $HOME for unwanted files and directories
brew "xdg-ninja"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Screen saver based on animations presented during Apple Special Event Brooklyn
cask "brooklyn"
# Screen capturing tool
cask "cleanshot"
# DjVu viewer and browser plugin
cask "djview"
# Tool to hide status bar icons
cask "dozer"
# Client for the Dropbox cloud storage service
cask "dropbox"
# YAMAMOTO Mitsuharu's Mac port of GNU Emacs
cask "emacs-mac"
# Web browser
cask "firefox"
# Screen color temperature controller
cask "flux"
# Monospaced font that includes programming ligatures
cask "font-cascadia-code"
cask "font-courier-prime"
# Free monospaced font with programming ligatures
cask "font-fira-code"
cask "font-hack"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Code font with monospaced ligatures
cask "font-hasklig"
cask "font-inconsolata"
cask "font-input"
# Sans-serif, slab-serif, monospace and quasi‑proportional typeface family
cask "font-iosevka"
# Sans-serif, slab-serif, monospace and quasi‑proportional typeface family
cask "font-iosevka-slab"
# Typeface made for developers
cask "font-jetbrains-mono"
cask "font-lilex"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
cask "font-poppins"
cask "font-roboto-mono"
cask "font-source-code-pro"
cask "google-backup-and-sync"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Vector graphics editor
cask "inkscape"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Download manager
cask "jdownloader"
# Programming language for technical computing
cask "julia"
# GPU-based terminal emulator
cask "kitty"
# Office suite
cask "libreoffice"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Scanner app for math and science
cask "mathpix-snipping-tool"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Scientific and technical publishing system built on Pandoc
cask "quarto"
# Environment for statistical computing and graphics
cask "r"
# Data science software focusing on R and Python
cask "rstudio"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# PDF reader and note-taking application
cask "skim"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# App launcher/switcher
cask "spacelauncher"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Video communication and virtual meeting platform
cask "zoom"
